N = int(input())

dp = [0] * (N + 1)
<<<<<<< HEAD
if N == 1:
  print(1)
  exit()

dp[1] = 1
for i in range(1, N + 1):
  
=======
dp[1] = 1

for i in range(2, N + 1):
    # 먼저 이전 것에서 1 더해주는 것이므로
    dp[i] += dp[i - 1]
    
    # 짝수면 2나눈 것에서 모두 2를 곱해서 더한 것과 같다
    if i % 2 == 0:
        dp[i] += dp[i // 2] 
        
    dp[i] %= 1000000000
        
    # print(dp)
print(dp[N])    
    
# 1

# 1 1
# 2

# 1 1 1
# 1 2

# 1 1 1 1
# 1 1 2
# 2 2
# 4

# 1 1 1 1 1
# 1 1 1 2
# 1 2 2
# 1 4

# 1 1 1 1 1 1
# 1 1 1 1 2
# 1 1 2 2
# 1 1 4
# 2 2 2
# 2 4

# 1 1 1 1 1 1 1 
# 1 1 1 1 1 2
# 1 1 1 2 2
# 1 1 1 4
# 1 2 2 2
# 1 2 4

# 1 1 1 1 1 1 1 1 
# 1 1 1 1 1 1 2
# 1 1 1 1 2 2
# 1 1 1 1 4
# 1 1 2 2 2
# 1 1 2 4
# 2 2 2 2
# 2 2 4
# 4 4
# 8
>>>>>>> e9b01ee4ee894a5aa3f6d3ee57afb55d3829242a
